SeniorProject-2016/Chip-Design/proj_asic/psoc/I2S/Wave Generator 2.0/Wave Generator.cydsn/Generated_Source/PSoC5/ADC.c
/******************************************************************************
* Function Name: ADC_SetDSMRef0Reg(uint8)
******************************************************************************
*
* Summary:
*  This API sets the DSM_REF0 register. This is written for internal use.
*
* Parameters:
*  value:  Value to be written to DSM_REF0 register.
*
* Return:
*  None
*
******************************************************************************/
static void ADC_SetDSMRef0Reg(uint8 value) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_RESET_CR4_REG |= (ADC_IGNORE_PRESA1 | ADC_IGNORE_PRESD1);
    ADC_RESET_CR5_REG |= (ADC_IGNORE_PRESA2 | ADC_IGNORE_PRESD2);
    ADC_DSM_REF0_REG = value;

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_PRES_DELAY_TIME);
    /* Enable the press circuit */
    ADC_RESET_CR4_REG &= (uint8)~(ADC_IGNORE_PRESA1 | ADC_IGNORE_PRESD1);
    ADC_RESET_CR5_REG &= (uint8)~(ADC_IGNORE_PRESA2 | ADC_IGNORE_PRESD2);

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_Read8
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int8:  ADC result.
*
*******************************************************************************/
int8 ADC_Read8(void) 
{
    int8 result;

    /* Clear pending conversion done status */
    ADC_DEC_SR_REG |= ADC_DEC_INTR_CLEAR;
    ADC_StartConvert();
    (void)ADC_IsEndConversion(ADC_WAIT_FOR_RESULT);
     result = ADC_GetResult8();
    ADC_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_Read16
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*   void
*
* Return:
*  int16:  ADC result.
*
*******************************************************************************/
int16 ADC_Read16(void) 
{
    int16 result;

    /* Clear pending conversion done status */
    ADC_DEC_SR_REG |= ADC_DEC_INTR_CLEAR;
    ADC_StartConvert();
    (void)ADC_IsEndConversion(ADC_WAIT_FOR_RESULT);
     result = ADC_GetResult16();
    ADC_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_Read32
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int32: ADC result.
*
*******************************************************************************/
int32 ADC_Read32(void) 
{
    int32 result;
    
    /* Clear pending conversion done status */
    ADC_DEC_SR_REG |= ADC_DEC_INTR_CLEAR;
    ADC_StartConvert();
    (void)ADC_IsEndConversion(ADC_WAIT_FOR_RESULT);
     result = ADC_GetResult32();
    ADC_StopConvert();
    
     return(result);
}


/* [] END OF FILE */
